Repository: TomaszP05/Lester
Catalog: lib/l10n/app_*.arb
Languages: es, fr

source: Settings
es: Configuración
fr: Paramètres

source: Notifications
es: Notificaciones

source: Send Test Notification
es: Enviar notificación de prueba
fr: Envoyer une notification de test

# testNotificationSubtitle
source: Test your notification settings
es: Prueba la configuración de notificaciones
fr: Testez vos paramètres de notification

source: ✅ Test notification sent!
es: ✅ ¡Notificación de prueba enviada!
fr: ✅ Notification de test envoyée !

source: Language
es: Idioma
fr: Langue

source: Select Language
es: Seleccionar idioma
fr: Choisir la langue

source: English
es: Inglés
fr: Anglais

source: Spanish
es: Español
fr: Espagnol

source: French
es: Francés
fr: Français

source: Home
es: Inicio
fr: Accueil

source: Journal
es: Diario

source: Challenges
es: Desafíos
fr: Défis

source: Mood
es: Ánimo
fr: Humeur

source: Weekly Reflection
es: Reflexión semanal
fr: Réflexion hebdomadaire

source: Reflection Saved
es: Reflexión guardada
fr: Réflexion enregistrée

# reflectionSummary
source: You've been most kind when helping others and yourself directly.
es: Has sido más amable al ayudar a otros y a ti mismo directamente.
fr: Vous avez été le plus gentil en aidant les autres et vous-même directement.

# reflectionKindnessPrompt
source: 💭 What act of kindness made you feel proud this week?
es: 💭 ¿Qué acto de bondad te hizo sentir orgulloso esta semana?
fr: 💭 Quel acte de gentillesse vous a rendu fier cette semaine ?

# writeAnswerHere
source: Write your answer here...
es: Escribe tu respuesta aquí...
fr: Écrivez votre réponse ici...

# reflectionMoodPrompt
source: 😌 How was your overall mood this week?
es: 😌 ¿Cómo fue tu estado de ánimo general esta semana?
fr: 😌 Quel a été votre état d'esprit général cette semaine ?

# reflectionProductivityPrompt
source: 📈 How would you rate your overall productivity this week?
es: 📈 ¿Cómo calificarías tu productividad general esta semana?
fr: 📈 Comment évalueriez-vous votre productivité générale cette semaine ?

source: Submit Reflection
es: Enviar reflexión
fr: Soumettre la réflexion

# selectMoodTitle
source: Select your {type} mood
es: Selecciona tu estado de ánimo {type}
fr: Sélectionnez votre humeur {type}

# moodLabelHappy
source: 😊 Happy
es: 😊 Feliz
fr: 😊 Heureux

# moodLabelSad
source: 😔 Sad
es: 😔 Triste
fr: 😔 Triste

# moodLabelAngry
source: 😡 Angry
es: 😡 Enojado
fr: 😡 En colère

# moodLabelTired
source: 😴 Tired
es: 😴 Cansado
fr: 😴 Fatigué

# moodLabelRelaxed
source: 😌 Relaxed
es: 😌 Relajado
fr: 😌 Détendu

# moodLabelShocked
source: 😲 Shocked
es: 😲 Sorprendido
fr: 😲 Choqué

# moodLabelConfused
source: 😕 Confused
es: 😕 Confundido
fr: 😕 Confus

# selectedMood
source: You selected: {mood}
es: Has seleccionado: {mood}
fr: Vous avez sélectionné : {mood}

# fillAllMoods
source: Please select all moods before saving.
es: Por favor selecciona todos los estados de ánimo antes de guardar.
fr: Veuillez sélectionner toutes les humeurs avant d'enregistrer.

# moodSaved
source: Mood saved successfully! 💾
es: ¡Ánimo guardado exitosamente! 💾
fr: Humeur enregistrée avec succès ! 💾

# noMoodsSaved
source: No moods saved yet! 😴
es: ¡Aún no hay ánimos guardados! 😴
fr: Aucune humeur enregistrée pour le moment ! 😴

source: Saved Moods
es: Ánimos guardados
fr: Humeurs enregistrées

source: Close
es: Cerrar
fr: Fermer

source: Track Your Mood 🌸
es: Registra tu ánimo 🌸
fr: Suivez votre humeur 🌸

source: Select Overall Mood
es: Seleccionar ánimo general
fr: Sélectionner l'humeur générale

# selectMoodBefore
source: Select Mood Before Challenge
es: Seleccionar ánimo antes del desafío
fr: Sélectionner l'humeur avant le défi

# selectMoodAfter
source: Select Mood After Challenge
es: Seleccionar ánimo después del desafío
fr: Sélectionner l'humeur après le défi

# overallMood
source: Overall Mood: {mood}
es: Ánimo general: {mood}
fr: Humeur générale : {mood}

# beforeMood
source: Before Mood: {mood}
es: Ánimo antes: {mood}
fr: Humeur avant : {mood}

# afterMood
source: After Mood: {mood}
es: Ánimo después: {mood}
fr: Humeur après : {mood}

source: Save Mood
es: Guardar ánimo
fr: Enregistrer l'humeur

source: View Saved Moods
es: Ver ánimos guardados
fr: Voir les humeurs enregistrées

source: Mood Tracker
es: Rastreador de ánimo
fr: Suivi de l'humeur

# dailyInsightsTitle
source: Daily Insights
es: Ideas diarias
fr: Aperçus quotidiens

# todaysChallengeTitle
source: Today's Challenge
es: Desafío de hoy
fr: Défi du jour

# noChallengeMessage
source: No challenge available for today
es: No hay desafío disponible para hoy
fr: Aucun défi disponible pour aujourd'hui

# weeklyReflectionTitle
source: Weekly Reflection Quiz
es: Cuestionario de reflexión semanal
fr: Quiz de réflexion hebdomadaire

source: Start Weekly Reflection
es: Comenzar reflexión semanal
fr: Commencer la réflexion hebdomadaire

# welcomeTitle
source: Welcome to Lester 🌸!
es: ¡Bienvenido a Lester 🌸!
fr: Bienvenue chez Lester 🌸!

# welcomeSubtitle
source: Let's log how you're feeling
es: Registremos cómo te sientes
fr: Enregistrons comment vous vous sentez

# quoteLoadError
source: Could not load quote. Please try again.
es: No se pudo cargar la cita. Por favor, inténtalo de nuevo.
fr: Impossible de charger la citation. Veuillez réessayer.

# weatherLoadError
source: Could not load weather. Please try again.
es: No se pudo cargar el clima. Por favor, inténtalo de nuevo.
fr: Impossible de charger la météo. Veuillez réessayer.

# quoteFallback
source: Stay positive and keep going.
es: Mantente positivo y sigue adelante.
fr: Restez positif et continuez.

# unknownAuthor
source: Unknown
es: Desconocido
fr: Inconnu

source: Try again
es: Intentar de nuevo
fr: Réessayer

# daily_challenge_1_name
source: Daily Challenge 1
es: Desafío Diario 1
fr: Défi Quotidien 1

# daily_challenge_1_description
source: Smile at five people today
es: Sonríe a cinco personas hoy
fr: Souris à cinq personnes aujourd'hui

# daily_challenge_2_name
source: Daily Challenge 2
es: Desafío Diario 2
fr: Défi Quotidien 2

# daily_challenge_2_description
source: Send a positive message to someone you care about
es: Envía un mensaje positivo a alguien que te importe
fr: Envoie un message positif à quelqu'un qui t'est cher

# daily_challenge_3_name
source: Daily Challenge 3
es: Desafío Diario 3
fr: Défi Quotidien 3

# daily_challenge_3_description
source: Take a short walk outside and appreciate nature
es: Da un paseo corto al aire libre y aprecia la naturaleza
fr: Fais une petite promenade dehors et apprécie la nature

# daily_challenge_4_name
source: Daily Challenge 4
es: Desafío Diario 4
fr: Défi Quotidien 4

# daily_challenge_4_description
source: Do one household task you’ve been putting off
es: Haz una tarea doméstica que has estado posponiendo
fr: Fais une tâche ménagère que tu as repoussée

# daily_challenge_5_name
source: Daily Challenge 5
es: Desafío Diario 5
fr: Défi Quotidien 5

# daily_challenge_5_description
source: Compliment someone sincerely
es: Haz un cumplido sincero a alguien
fr: Fais un compliment sincère à quelqu'un

# daily_challenge_6_name
source: Daily Challenge 6
es: Desafío Diario 6
fr: Défi Quotidien 6

# daily_challenge_6_description
source: Drink at least 8 glasses of water today
es: Bebe al menos 8 vasos de agua hoy
fr: Bois au moins 8 verres d'eau aujourd'hui

# daily_challenge_7_name
source: Daily Challenge 7
es: Desafío Diario 7
fr: Défi Quotidien 7

# daily_challenge_7_description
source: Write a thank you note to a friend
es: Escribe una nota de agradecimiento a un amigo
fr: Écris un mot de remerciement à un ami

# daily_challenge_8_name
source: Daily Challenge 8
es: Desafío Diario 8
fr: Défi Quotidien 8

# daily_challenge_8_description
source: Hold the door open for someone
es: Sujeta la puerta a alguien
fr: Tiens la porte à quelqu'un

# daily_challenge_9_name
source: Daily Challenge 9
es: Desafío Diario 9
fr: Défi Quotidien 9

# daily_challenge_9_description
source: Compliment a stranger
es: Haz un cumplido a un desconocido
fr: Fais un compliment à un inconnu

# daily_challenge_10_name
source: Daily Challenge 10
es: Desafío Diario 10
fr: Défi Quotidien 10

# daily_challenge_10_description
source: Take a picture of a flower and upload a picture!
es: ¡Toma una foto de una flor y súbela!
fr: Prends une photo de fleur et télécharge une photo !

# daily_challenge_11_name
source: Daily Challenge 11
es: Desafío Diario 11
fr: Défi Quotidien 11

# daily_challenge_11_description
source: Listen to your favorite song and do nothing else
es: Escucha tu canción favorita y no hagas nada más
fr: Écoute ta chanson préférée sans rien faire d'autre

# daily_challenge_12_name
source: Daily Challenge 12
es: Desafío Diario 12
fr: Défi Quotidien 12

# daily_challenge_12_description
source: Try a new food or drink you’ve never had before
es: Prueba una nueva comida o bebida que nunca antes habías tomado
fr: Essaie un nouvel aliment ou une nouvelle boisson que tu n'as jamais goûté(e)

# daily_challenge_13_name
source: Daily Challenge 13
es: Desafío Diario 13
fr: Défi Quotidien 13

# daily_challenge_13_description
source: Send a kind text to a family member
es: Envía un mensaje amable a un familiar
fr: Envoie un gentil message à un membre de ta famille

# daily_challenge_14_name
source: Daily Challenge 14
es: Desafío Diario 14
fr: Défi Quotidien 14

# daily_challenge_14_description
source: Pick up a piece of litter you find outside
es: Recoge un trozo de basura que encuentres fuera
fr: Ramasse un déchet que tu trouves dehors

# daily_challenge_15_name
source: Daily Challenge 15
es: Desafío Diario 15
fr: Défi Quotidien 15

# daily_challenge_15_description
source: Spend 10 minutes stretching or meditating
es: Dedica 10 minutos a estirar o meditar
fr: Passe 10 minutes à t'étirer ou à méditer

# daily_challenge_16_name
source: Daily Challenge 16
es: Desafío Diario 16
fr: Défi Quotidien 16

# daily_challenge_16_description
source: Donate an item you no longer use
es: Dona un artículo que ya no uses
fr: Fais don d'un objet que tu n'utilises plus

# daily_challenge_17_name
source: Daily Challenge 17
es: Desafío Diario 17
fr: Défi Quotidien 17

# daily_challenge_17_description
source: Give someone a genuine compliment
es: Haz un cumplido genuino a alguien
fr: Fais un compliment sincère à quelqu'un

# daily_challenge_18_name
source: Daily Challenge 18
es: Desafío Diario 18
fr: Défi Quotidien 18

# daily_challenge_18_description
source: Write down three things you’re grateful for
es: Escribe tres cosas por las que estás agradecido/a
fr: Écris trois choses pour lesquelles tu es reconnaissant(e)

# daily_challenge_19_name
source: Daily Challenge 19
es: Desafío Diario 19
fr: Défi Quotidien 19

# daily_challenge_19_description
source: Call or video chat with a loved one
es: Llama o haz una videollamada con un ser querido
fr: Appelle ou fais un appel vidéo avec un être cher

# daily_challenge_20_name
source: Daily Challenge 20
es: Desafío Diario 20
fr: Défi Quotidien 20

# daily_challenge_20_description
source: Share an inspiring quote on social media
es: Comparte una cita inspiradora en las redes sociales
fr: Partage une citation inspirante sur les réseaux sociaux

# daily_challenge_21_name
source: Daily Challenge 21
es: Desafío Diario 21
fr: Défi Quotidien 21

# daily_challenge_21_description
source: Take a photo of something that makes you happy
es: Toma una foto de algo que te haga feliz
fr: Prends en photo quelque chose qui te rend heureux/heureuse

# daily_challenge_22_name
source: Daily Challenge 22
es: Desafío Diario 22
fr: Défi Quotidien 22

# daily_challenge_22_description
source: Spend one hour without your phone or computer
es: Pasa una hora sin tu teléfono u ordenador
fr: Passe une heure sans ton téléphone ni ton ordinateur

# daily_challenge_23_name
source: Daily Challenge 23
es: Desafío Diario 23
fr: Défi Quotidien 23

# daily_challenge_23_description
source: Help someone without expecting anything in return
es: Ayuda a alguien sin esperar nada a cambio
fr: Aide quelqu'un sans rien attendre en retour

# daily_challenge_24_name
source: Daily Challenge 24
es: Desafío Diario 24
fr: Défi Quotidien 24

# daily_challenge_24_description
source: Cook or prepare a healthy meal
es: Cocina o prepara una comida saludable
fr: Cuisine ou prépare un repas sain

# daily_challenge_25_name
source: Daily Challenge 25
es: Desafío Diario 25
fr: Défi Quotidien 25

# daily_challenge_25_description
source: Leave a positive review for a small business
es: Deja una reseña positiva para un pequeño negocio
fr: Laisse un avis positif pour une petite entreprise

# daily_challenge_26_name
source: Daily Challenge 26
es: Desafío Diario 26
fr: Défi Quotidien 26

# daily_challenge_26_description
source: Spend 15 minutes journaling or reflecting
es: Dedica 15 minutos a escribir en un diario o a reflexionar
fr: Passe 15 minutes à écrire dans un journal ou à réfléchir

# daily_challenge_27_name
source: Daily Challenge 27
es: Desafío Diario 27
fr: Défi Quotidien 27

# daily_challenge_27_description
source: Say “thank you” to someone who helps you today
es: Di «gracias» a alguien que te ayude hoy
fr: Dis « merci » à quelqu'un qui t'aide aujourd'hui

# daily_challenge_28_name
source: Daily Challenge 28
es: Desafío Diario 28
fr: Défi Quotidien 28

# daily_challenge_28_description
source: Read or listen to something uplifting
es: Lee o escucha algo edificante
fr: Lis ou écoute quelque chose d'édifiant

# daily_challenge_29_name
source: Daily Challenge 29
es: Desafío Diario 29
fr: Défi Quotidien 29

# daily_challenge_29_description
source: Do a random act of kindness anonymously
es: Haz un acto de bondad al azar de forma anónima
fr: Fais un acte de gentillesse au hasard de manière anonyme

# daily_challenge_30_name
source: Daily Challenge 30
es: Desafío Diario 30
fr: Défi Quotidien 30

# daily_challenge_30_description
source: Spend 10 minutes organizing your space
es: Dedica 10 minutos a organizar tu espacio
fr: Passe 10 minutes à organiser ton espace

# daily_challenge_31_name
source: Daily Challenge 31
es: Desafío Diario 31
fr: Défi Quotidien 31

# daily_challenge_31_description
source: Reflect on the month — what are you proud of?
es: Reflexiona sobre el mes: ¿de qué estás orgulloso/a?
fr: Réfléchis au mois – de quoi es-tu fier/fière ?

# testNotificationError
source: ❌ Error: {error}
fr: ❌ Erreur : {error}

# moodLabelNeutral
source: 😐 Neutral
fr: 😐 Neutre
